Revit 2024 API
TabbedDialogExtension.OnOKAction Property
The ok handler.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public TabbedDialogAction OnOKAction { get; }
Visual Basic
Public ReadOnly Property OnOKAction As TabbedDialogAction
	Get
Visual C++
public:
property TabbedDialogAction^ OnOKAction {
	TabbedDialogAction^ get ();
}
Remarks
This handler will be invoked when the "Ok" button in Revit options dialog is clicked.
See Also
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace